src/cf/Enums/ВидыОперацийПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеЗемельныхУчастков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупкаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиФакторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРеализацияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупТоваровКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийСчетаПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетаПокупателю</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УправлениеПанельюПодсказкиКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает максимально допустимое количество советов, размещаемых в панели подсказок
//
// Возвращаемое значение:
//   Число - количество советов
Функция МаксимальноеКоличествоСоветовВПанели() Экспорт
	
	Возврат 4;
	
КонецФункции

// Возвращает максимально допустимое количество видеороликов, размещаемых в панели подсказок
//
// Возвращаемое значение:
//   Число - количество видеороликов
Функция МаксимальноеКоличествоВидеороликовВПанели() Экспорт
	
	Возврат 3;
	
КонецФункции

// Возвращает наименование раздела учёта, для которого открыта панель подсказок
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - открытая форма раздела
//
// Возвращаемое значение:
//   Строка
//
Функция НаименованиеОткрытогоРаздела(Форма) Экспорт
	
	Результат = "";
	
	ИмяФормы = Форма.ИмяФормы;
	
	ЧастиИмениФормы = СтрРазделить(ИмяФормы, ".", Ложь);
	Если ЧастиИмениФормы.Количество() > 1 Тогда
		Результат = ЧастиИмениФормы[1];
	КонецЕсли;
	
	ВидОперации = Неопределено;
	ЭтоФормаДокумента  = СтрНачинаетсяС(ИмяФормы, "Документ.");
	Если ЭтоФормаДокумента Тогда
		Форма.Объект.Свойство("ВидОперации", ВидОперации);
	КонецЕсли;
	
	Если ВидОперации = Неопределено Тогда
		Возврат Результат;
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Оборудование") Тогда
		Возврат Результат + "ПокупкаКомиссия";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Товары") Тогда
		Возврат Результат + "Товары";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги") Тогда
		Возврат Результат + "Услуги";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Оборудование") Тогда
		Возврат Результат + "ПродажаКомиссия";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары") Тогда
		Возврат Результат + "Товары";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги") Тогда
		Возврат Результат + "Услуги";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетаПокупателю.ТоварыИУслуги") Тогда
		Возврат Результат;
	Иначе
		Возврат ""; // для вида операции подсказки не предусмотрены
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет событие бизнес-статистики в журнал регистрации
//
// Параметры:
//   ИмяОперации - Строка - Имя операции для отслеживания статистики
//
Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации) Экспорт
	
	ИмяКлючевойОперации = СтрШаблон("СтатистикаБП.ПанельПодсказок.%1", ИмяОперации);
	СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие(ИмяКлючевойОперации);
	
КонецПроцедуры

// Возвращает цвет, которым выделяются элементы подсказки на форме
//
// Возвращаемое значение:
//  Цвет - цвет фона выделения элемента подсказки
Функция ЦветФонаВыделенияЭлементаПодсказки() Экспорт
	
	Возврат Новый Цвет(255, 227, 20);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает наименование раздела, предназначенного для работы с деньгами
//
// Возвращаемое значение:
//   Строка
//
Функция РазделДеньги() Экспорт
	
	Возврат "Деньги";
	
КонецФункции

// Возвращает наименование раздела, предназначенного для работы с документами
//
// Возвращаемое значение:
//   Строка
//
Функция РазделДокументы() Экспорт
	
	Возврат "Документы";
	
КонецФункции

// Возвращает наименование раздела, предназначенного для работы с товарами
//
// Возвращаемое значение:
//   Строка
//
Функция РазделТовары() Экспорт
	
	Возврат "Номенклатура";
	
КонецФункции

// Возвращает наименование раздела, предназначенного для работы с контрагентами
//
// Возвращаемое значение:
//   Строка
//
Функция РазделКонтрагенты() Экспорт
	
	Возврат "Контрагенты";
	
КонецФункции

// Возвращает имя документа "Счет на оплату покупателю", в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументСчетНаОплатуПокупателю() Экспорт
	
	Возврат "СчетНаОплатуПокупателю";
	
КонецФункции

// Возвращает имя документа "Счет на оплату от поставщика", в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументСчетНаОплатуПоставщика() Экспорт
	
	Возврат "СчетНаОплатуПоставщика";
	
КонецФункции

// Возвращает имя документа "Поступление товаров и услуг" с видом операции ""Покупка/комиссия"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументПоступлениеТоваровУслугПокупкаКомиссия() Экспорт
	
	Возврат "ПоступлениеТоваровУслугПокупкаКомиссия";
	
КонецФункции

// Возвращает имя документа "Поступление товаров и услуг" с видом операции ""Товары"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументПоступлениеТоваровУслугТовары() Экспорт
	
	Возврат "ПоступлениеТоваровУслугТовары";
	
КонецФункции

// Возвращает имя документа "Поступление товаров и услуг" с видом операции ""Услуги"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументПоступлениеТоваровУслугУслуги() Экспорт
	
	Возврат "ПоступлениеТоваровУслугУслуги";
	
КонецФункции

// Возвращает имя документа "Реализация товаров и услуг" с видом операции ""Продажа/комиссия"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументРеализацияТоваровУслугПродажаКомиссия() Экспорт
	
	Возврат "РеализацияТоваровУслугПродажаКомиссия";
	
КонецФункции

// Возвращает имя документа "Реализация товаров и услуг" с видом операции ""Товары"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументРеализацияТоваровУслугТовары() Экспорт
	
	Возврат "РеализацияТоваровУслугТовары";
	
КонецФункции

// Возвращает имя документа "Реализация товаров и услуг" с видом операции ""Услуги"",
// в форме которого открывается панель подсказок
//
// Возвращаемое значение:
//   Строка - имя документа
//
Функция ДокументРеализацияТоваровУслугУслуги() Экспорт
	
	Возврат "РеализацияТоваровУслугУслуги";
	
КонецФункции

// Определяет раздел формы списка, в которой открывается панель подсказок
//
// Параметры:
//   НаименованиеРаздела - Строка - имя раздела, связанного с формой
//
// Возвращаемое значение:
//   Булево - Истина, если это раздел формы списка
//
Функция ЭтоРазделСписка(НаименованиеРаздела) Экспорт
	
	Возврат НаименованиеРаздела = РазделДеньги()
		Или НаименованиеРаздела = РазделДокументы()
		Или НаименованиеРаздела = РазделТовары()
		Или НаименованиеРаздела = РазделКонтрагенты();
	
КонецФункции

#КонецОбласти
